# Pandas (2)

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

## Задачи для совместного разбора

In [1]:
import pandas as pd

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [2]:
df = pd.read_csv('C:/Users/icom1/OneDrive - icom/Рабочий стол/sp500hst.txt', sep=',', header=None, 
                   names=["date", "ticker", "open", "high", "low", "close", "volume"])
df.head()

       date ticker   open     high     low  close  volume
0  20090821      A  25.60  25.6100  25.220  25.55   34758
1  20090824      A  25.64  25.7400  25.330  25.50   22247
2  20090825      A  25.50  25.7000  25.225  25.34   30891
3  20090826      A  25.32  25.6425  25.145  25.48   33334
4  20090827      A  25.50  25.5700  25.230  25.54   70176

2. Посчитайте количество уникальных цифр, которые используются каждой строке в столбце volume.

In [3]:
def n_digits(volume):
    return len((set(str(volume))))

In [4]:
df['volume'].map(n_digits)

0         5
1         3
2         5
3         2
4         4
         ..
122569    4
122570    5
122571    5
122572    5
122573    4
Name: volume, Length: 122574, dtype: int64

3. Для каждой строки рассчитайте разность между значениями high и low, если индекс столбца нечетный, и разность между close и open в противном случае.

In [5]:
def diff(row):
    if row.name % 2:
        return row['high'] - row['low']
    else:
        return row['close'] - row['open']

In [6]:
df.apply(diff, axis=1)

0        -0.0500
1         0.4100
2        -0.1600
3         0.4975
4         0.0400
           ...
122569    0.5200
122570   -0.1300
122571    0.7100
122572   -1.4100
122573    1.0700
Length: 122574, dtype: float64

In [7]:
import numpy as np

In [8]:
np.where(
    df.index % 2 == 1,
    df['high'] - df['low'],
    df['close'] - df['open']
)

array([-0.05,  0.41, -0.16, ...,  0.71, -1.41,  1.07])

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

In [9]:
df.groupby('ticker')['volume'].sum()

ticker
A        8609336
AA      81898998
AAPL    52261170
ABC      9006756
ABT     18975870
          ...
XTO     21297931
YHOO    56837171
YUM     10971538
ZION    15551119
ZMH      4938916
Name: volume, Length: 524, dtype: int64

In [10]:
df.groupby('ticker').filter(lambda group: group['open'].max() >= 100)

            date ticker    open    high     low   close  volume
490     20090821   AAPL  167.81  169.37  166.80  169.22  148597
491     20090824   AAPL  170.00  170.71  168.27  169.06  145331
492     20090825   AAPL  169.43  170.94  169.13  169.40  115840
493     20090826   AAPL  168.94  169.55  166.76  167.41  108570
494     20090827   AAPL  168.59  169.57  164.83  169.45  160421
...          ...    ...     ...     ...     ...     ...     ...
118668  20100813    WPO  347.95  351.71  337.85  343.48    1681
118669  20100816    WPO  304.00  321.14  295.56  315.65    8774
118670  20100817    WPO  324.59  336.58  319.74  327.63    3035
118671  20100819    WPO  337.94  348.40  333.46  345.61    2197
118672  20100820    WPO  344.20  349.43  339.29  347.68    1828

[6828 rows x 7 columns]

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

In [11]:
df2 = pd.read_csv('C:/Users/icom1/OneDrive - icom/Рабочий стол/sp_data2.csv', sep=';', header=None, 
                   names=["ticker", "name", "annual_income"],
                )
df2.head(2)

  ticker        name annual_income
0   AAPL       Apple          3.6%
1   AMZN  Amazon.com          3.2%

In [12]:
df.merge(df2, how='inner', left_on='ticker', right_on='ticker')

,date,ticker,open,high,low,close,volume,name,annual_income
0,20090821,A,25.60,25.6100,25.220,25.55,34758,Agilent Technologies,0.1%
1,20090824,A,25.64,25.7400,25.330,25.50,22247,Agilent Technologies,0.1%
2,20090825,A,25.50,25.7000,25.225,25.34,30891,Agilent Technologies,0.1%
3,20090826,A,25.32,25.6425,25.145,25.48,33334,Agilent Technologies,0.1%
4,20090827,A,25.50,25.5700,25.230,25.54,70176,Agilent Technologies,0.1%
...,...,...,...,...,...,...,...,...,...
82167,20100813,ZION,20.17,20.4300,19.840,19.89,25193,Zions Bancorp,0.0%
82168,20100816,ZION,19.81,19.9600,19.600,19.95,25914,Zions Bancorp,0.0%
82169,20100817,ZION,20.07,20.4700,19.830,20.31,31717,Zions Bancorp,0.0%
82170,20100819,ZION,19.83,20.0000,19.130,19.35,45935,Zions Bancorp,0.0%
82171,20100820,ZION,19.15,19.2700,18.810,19.14,37225,Zions Bancorp,0.0%

## Лабораторная работа №2.2

__Данная работа является продолжением ЛР №2. Для начала работы загрузите таблицы (см. задание 1.1)__

In [13]:
recipes = pd.read_csv('C:/Users/icom1/OneDrive - icom/Рабочий стол/recipes_sample.csv', sep=',')
reviews = pd.read_csv('C:/Users/icom1/OneDrive - icom/Рабочий стол/reviews_sample.csv', sep=',')
reviews.rename(columns = {'Unnamed: 0' : 'index'}, inplace = True)
reviews.head()

,index,user_id,recipe_id,date,rating,review
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
2,187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
3,706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
4,312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

### Применение функций к pd.Series и pd.DataFrame

4.1 Напишите функцию, которая переводит минуты в формат "XhYm". Примените эту функцию к столбцу `minutes` таблицы `recipes` (без перезаписи исходного столбца) при помощи метода `map`.

In [14]:
recipes.head(2)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN

In [15]:
def m_to_hm(m: int) -> str:
    return f"{m//60}h{m%60}m"
#ассерт проверка правильности написания функции
#м: инт - подсказка, что м-целое число - стр -результат
assert m_to_hm(90) == "1h30m"
assert m_to_hm(10) == "0h10m"

In [16]:
recipes['minutes'].map(m_to_hm)

0        1h30m
1        0h10m
2        0h30m
3        0h45m
4        0h25m
         ...
29995    1h20m
29996     4h0m
29997    1h15m
29998     1h0m
29999    0h29m
Name: minutes, Length: 30000, dtype: object

4.2 На основе таблицы `recipes` создайте таблицу, которая содержит только текстовые столбцы (используйте метод `select_dtypes`).  Примените к каждому элементу этой таблицы строковый метод `str.capitalize` при помощи метода `applymap`, не удаляя пропуски.

In [17]:
recipes.dtypes

name               object
id                  int64
minutes             int64
contributor_id      int64
submitted          object
n_steps           float64
description        object
n_ingredients     float64
dtype: object

In [18]:
recipes.select_dtypes(include = 'object').applymap(str.capitalize, na_action='ignore')

,name,submitted,description
0,George s at the cove black bean soup,2002-10-25,An original recipe created by chef scott meska...
1,Healthy for them yogurt popsicles,2003-07-26,My children and their friends ask for my homem...
2,I can t believe it s spinach,2002-08-29,"These were so go, it surprised even me."
3,Italian gut busters,2002-07-27,My sister-in-law made these for us at a family...
4,Love is in the air beef fondue sauces,2004-02-23,I think a fondue is a very romantic casual din...
...,...,...,...
29995,Zurie s holey rustic olive and cheddar bread,2007-11-25,This is based on a french recipe but i changed...
29996,Zwetschgenkuchen bavarian plum cake,2009-08-24,"This is a traditional fresh plum cake, thought..."
29997,Zwiebelkuchen southwest german onion cake,2004-11-03,This is a traditional late summer early fall s...
29998,Zydeco soup,2012-08-29,This is a delicious soup that i originally fou...
29999,Cookies by design cookies on a stick,2008-04-15,"I've heard of the 'cookies by design' company,..."

4.3 Напишите функцию, которая принимает на вход серию `pd.Series` и для серий, содержащих текстовые данные, возвращает максимальную длину строк в ней, а для числовых серий возвращает минимальный элемент в этой серии. Примените данную функцию к каждому столбцу таблицы `recipes` при помощи метода `apply`.

In [19]:
recipes.dtypes

name               object
id                  int64
minutes             int64
contributor_id      int64
submitted          object
n_steps           float64
description        object
n_ingredients     float64
dtype: object

In [20]:
def get_stats(x: pd.Series) -> int:
    if x.dtypes == 'object':
        return x.str.len().max()
    elif x.dtypes == 'int64':
        return x.min()

assert get_stats(pd.Series(['a', 'bbbb', 'ccc'])) == 4
assert get_stats(pd.Series([1, 3, 2])) == 1

### Группировки таблиц `pd.DataFrame`

5.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [21]:
recipes.head(2)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN

In [22]:
recipes.groupby('contributor_id')['id'].count().idxmax()

89831

5.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

In [23]:
reviews.head(2)

,index,user_id,recipe_id,date,rating,review
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...

In [24]:
new_df = reviews.groupby('recipe_id')[['date', 'rating']].mean()
new_df[new_df['rating'] == 0].count()

rating    660
dtype: int64

5.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [25]:
recipes.head()

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [26]:
recipes.submitted = pd.to_datetime(recipes.submitted)
recipes['new_year'] = recipes.submitted.dt.year
recipes.groupby('new_year')['name'].count()

new_year
1999     275
2000     104
2001     589
2002    2644
2003    2334
2004    2153
2005    3130
2006    3473
2007    4429
2008    4029
2009    2963
2010    1538
2011     922
2012     659
2013     490
2014     139
2015      42
2016      24
2017      39
2018      24
Name: name, dtype: int64

5.4 Напишите функцию, которая принимает на вход таблицу (аналогичную `recipes` по набору столбцов), и возвращает `True` в том случае, если в столбце `minutes` присутствуют только значения, меньшие либо равные 10. Сгруппируйте таблицу `recipes` по полю `contributor_id` и для каждого участника выясните, справедливо ли, что все его рецепты занимают не более 10 минут.

In [27]:
def has_only_fast_recipes(x: pd.DataFrame) -> bool:
    new_df = x.groupby('contributor_id')[['id','minutes']]
    return (x.minutes < 10).all()

assert not has_only_fast_recipes(
    pd.DataFrame(
        {
            "name": {0: "george s", 1: "healthy"},
            "id": {0: 44123, 1: 67664},
            "minutes": {0: 90, 1: 10},
            "contributor_id": {0: 35193, 1: 91970},
            "submitted": {0: "2002-10-25", 1: "2003-07-26"},
            "n_steps": {0: np.nan, 1: np.nan},
            "description": {0: "123", 1: "zxc"},
            "n_ingredients": {0: 18.0, 1: np.nan},
        }
    )
)
assert has_only_fast_recipes(
    pd.DataFrame(
        {
            "name": {0: "george s", 1: "healthy"},
            "id": {0: 44123, 1: 67664},
            "minutes": {0: 7, 1: 5},
            "contributor_id": {0: 35193, 1: 91970},
            "submitted": {0: "2002-10-25", 1: "2003-07-26"},
            "n_steps": {0: np.nan, 1: np.nan},
            "description": {0: "123", 1: "zxc"},
            "n_ingredients": {0: 18.0, 1: np.nan},
        }
    )
)

### Объединение таблиц `pd.DataFrame`

6.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [28]:
join_df = recipes.merge(reviews[~reviews['review'].isna()], 
                        left_on = 'id', 
                        right_on = 'recipe_id')[['id','name','user_id','rating']]
join_df.head()

      id                                   name  user_id  rating
0  44123  george s at the cove  black bean soup   743566       5
1  44123  george s at the cove  black bean soup    76503       5
2  44123  george s at the cove  black bean soup    34206       5
3  67664     healthy for them  yogurt popsicles   494084       5
4  67664     healthy for them  yogurt popsicles   303445       5

In [29]:
join_df['id'].isin(reviews[reviews['review'].isna()]['user_id']).any()

False

6.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [30]:
reviews['review_count'] = reviews.groupby('recipe_id')['review'].count()
reviews['review_count'].fillna(0, inplace = True)
reviews.head(2)

,index,user_id,recipe_id,date,rating,review,review_count
0,370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...,0.0
1,624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...,0.0

In [31]:
join_df_1 = recipes.merge(reviews,
                          left_on = 'id', 
                          right_on = 'recipe_id')[['recipe_id','name', 'review_count']]
join_df_1.head(2)

   recipe_id                                   name  review_count
0      44123  george s at the cove  black bean soup           0.0
1      44123  george s at the cove  black bean soup           0.0

In [32]:
join_df_1.groupby('recipe_id')['review_count'].count()

recipe_id
48         2
55         4
66        18
91         4
94         4
          ..
536547     1
536610     1
536728     1
536729     4
536747     4
Name: review_count, Length: 28100, dtype: int64

6.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

In [33]:
join_df_2 = recipes.merge(reviews,
                          left_on = 'id', 
                          right_on = 'recipe_id')[['recipe_id','submitted', 'rating']]
join_df_2.submitted = pd.to_datetime(join_df_2.submitted)
join_df_2['new_year'] = join_df_2.submitted.dt.year
join_df_2.head(2)

   recipe_id  submitted  rating  new_year
0      44123 2002-10-25       5      2002
1      44123 2002-10-25       5      2002

In [34]:
join_df_2.groupby(['new_year'])['rating'].mean().idxmin()

2017

### Сохранение таблиц `pd.DataFrame`

7.1 Отсортируйте результат выполнения задания 6.1 в порядке убывания величины столбца `id` и сохраните результаты в csv файл.

In [35]:
csv_file = join_df.iloc[join_df['id'].argsort()].to_csv('sorted.csv')
print('save is succesful')

save is succesful

7.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 6.1 и 6.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 6.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 6.2.

In [37]:
writer = pd.ExcelWriter("Join_dfs_excel.xlsx")
join_df.to_excel(writer, sheet_name="Рецепты с оценками")  
join_df_1.to_excel(writer, sheet_name="Количество отзывов по рецептам")  
print('save is succesful')

save is succesful

Вот и всё… Неплохая получилась история. Интересная, весёлая, порой немного грустная, а главное – поучительная… Она научила нас быть смелыми и не бояться вызовов, которые готовит нам жизнь. Помогала нам добиваться поставленных целей несмотря ни на что. И самое важное – она научила нас по-настоящему любить и не сходить с пути, следуя за своей мечтой.